from .Utils import (
   get_filter_results,
   get_file_details,
   is_subscribed,
   get_poster,
   Media
)
from .Channel import (
   RATING,
   GENRES
)

HELP = """
<b>Basic Commads

◯ /stats : ᴜsᴇʀ sᴛᴀᴛᴜs
◯ /about : ᴀʙᴏᴜᴛ ᴍᴇ

Bot Owner Only
◯ /broadcast ʀᴇᴘʟᴀʏ ᴀɴʏ ᴍᴇssᴀɢᴇ ᴏʀ ᴍᴇᴅɪᴀ
◯ /stats : ᴜsᴇʀ sᴛᴀᴛᴜs
◯ /ban_user  ᴄʟɪᴄᴋ ʙᴀɴ_ᴜsᴇʀ ᴍᴏʀᴇ ɪɴғᴏ
◯ /unban_user ᴄʟɪᴄᴋ ᴜɴʙᴀɴ_ᴜsᴇʀ ᴍᴏʀᴇ ɪɴғᴏ
◯ /banned_users Bᴀɴɴᴇᴅ ᴜsᴇʀ ᴅᴇᴛᴀɪʟs
◯ /total ʜᴏᴡ ᴍᴀɴʏ ғɪʟᴇs ᴀᴅᴅᴇᴅ ɪɴ ᴅᴀᴛᴀʙᴀsᴇ
◯ /logger ɢᴇᴛ ʟᴏɢs
◯ /delete ᴅᴇʟᴇᴛᴇ ғɪʟᴇ ғʀᴏᴍ ᴅᴀᴛᴀʙᴀsᴇ</b>

"""

ABOUT = """
★ 𝙼𝚈 𝙽𝙰𝙼𝙴: 𝚃𝙴𝚂𝚂𝙰
★ 𝙲𝚁𝙴𝙰𝚃𝙾𝚁;[𝙿𝚎𝙰𝚌𝙴-𝙵𝚒𝙶𝚑𝚃𝚎𝚁-𝚃𝙶](https://t.me/peace_fighter_TG)
★ 𝙻𝙸𝙱𝚁𝙰𝚁𝚈: [𝙿𝚈𝚁𝙾𝙶𝚁𝙰𝙼](https://docs.pyrogram.org/)
★ 𝙻𝙰𝙽𝙶𝚄𝙰𝙶𝙴: 𝙿𝚈𝚃𝙷𝙾𝙽 𝟹
★ 𝙳𝙰𝚃𝙰 𝙱𝙰𝚂𝙴; [𝙼𝙾𝙽𝙶𝙾 𝙳𝙱](https://www.mongodb.com/cloud)
★ 𝙱𝙾𝚃 𝚂𝙴𝚁𝚅𝙴𝚁: [𝙷𝙴𝚁𝙾𝙺𝚄](https://heroku.com/)
★ 𝙱𝚄𝙸𝙻𝙳 𝚂𝚃𝙰𝚃𝚄𝚂: 𝚅𝟻.𝟶 [ 𝙱𝙴𝚃𝙰 ]
"""
